#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.repos.github_branch_default.default["MS-Test13"] will be created
  + resource "github_branch_default" "default" {
      + branch     = "master"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = true
      + repository = "MS-Test13"
    }

  # module.repos.github_branch_protection.branch_policy[0] will be updated in-place
  ~ resource "github_branch_protection" "branch_policy" {
        id                              = "BPR_kwDOLCWx2s4Cunon"
        # (12 unchanged attributes hidden)

      - required_status_checks {
          - contexts = [
              - "ci/github-pipelines.yml",
            ] -> null
          - strict   = true -> null
        }

        # (1 unchanged block hidden)
    }

  # module.repos.github_branch_protection.branch_policy[1] will be updated in-place
  ~ resource "github_branch_protection" "branch_policy" {
        id                              = "BPR_kwDOLCWxzM4Cunom"
        # (12 unchanged attributes hidden)

      - required_status_checks {
          - contexts = [
              - "ci/github-pipelines.yml",
            ] -> null
          - strict   = true -> null
        }

        # (1 unchanged block hidden)
    }

  # module.repos.github_branch_protection.branch_policy[2] will be updated in-place
  ~ resource "github_branch_protection" "branch_policy" {
        id                              = "BPR_kwDOLDTAzc4CunqI"
        # (12 unchanged attributes hidden)

      - required_status_checks {
          - contexts = [
              - "ci/github-pipelines.yml",
            ] -> null
          - strict   = true -> null
        }

        # (1 unchanged block hidden)
    }

  # module.repos.github_branch_protection.branch_policy[3] will be created
  + resource "github_branch_protection" "branch_policy" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "master"
      + repository_id                   = "MS-Test13"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 2
          + restrict_dismissals             = false
        }
    }

  # module.repos.github_repository.repository_branch_autoinit["MS-Tes11"] will be created
  + resource "github_repository" "repository_branch_autoinit" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Repository managed by Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "MS-Tes11"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos.github_repository.repository_branch_autoinit["MS-Test10"] will be created
  + resource "github_repository" "repository_branch_autoinit" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Repository managed by Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "MS-Test10"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos.github_repository.repository_branch_autoinit["MS-Test12"] will be created
  + resource "github_repository" "repository_branch_autoinit" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Repository managed by Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "MS-Test12"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos.github_repository.repository_branch_autoinit["MS-Test13"] will be created
  + resource "github_repository" "repository_branch_autoinit" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Repository managed by Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "MS-Test13"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos.github_repository.repository_branch_autoinit["terraform-jrs-local"] will be created
  + resource "github_repository" "repository_branch_autoinit" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Repository managed by Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform-jrs-local"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos.github_repository.repository_branch_autoninit["MS-Tes11"] will be destroyed
  # (because github_repository.repository_branch_autoninit is not in configuration)
  - resource "github_repository" "repository_branch_autoninit" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "master" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Repository managed by Terraform" -> null
      - etag                        = "W/\"86c3bb45d3bfd2c4da6b317839a4e52332073b8a914dd9203705969c694f6a6c\"" -> null
      - full_name                   = "jrs-org/MS-Tes11" -> null
      - git_clone_url               = "git://github.com/jrs-org/MS-Tes11.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/jrs-org/MS-Tes11" -> null
      - http_clone_url              = "https://github.com/jrs-org/MS-Tes11.git" -> null
      - id                          = "MS-Tes11" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "MS-Tes11" -> null
      - node_id                     = "R_kgDOLCWxzA" -> null
      - private                     = false -> null
      - repo_id                     = 740667852 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:jrs-org/MS-Tes11.git" -> null
      - svn_url                     = "https://github.com/jrs-org/MS-Tes11" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.repos.github_repository.repository_branch_autoninit["MS-Test10"] will be destroyed
  # (because github_repository.repository_branch_autoninit is not in configuration)
  - resource "github_repository" "repository_branch_autoninit" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "master" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Repository managed by Terraform" -> null
      - etag                        = "W/\"6dc617b984c561dc5487ce582f67030addb72c6a1183184e5a2acad8e1e85af4\"" -> null
      - full_name                   = "jrs-org/MS-Test10" -> null
      - git_clone_url               = "git://github.com/jrs-org/MS-Test10.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/jrs-org/MS-Test10" -> null
      - http_clone_url              = "https://github.com/jrs-org/MS-Test10.git" -> null
      - id                          = "MS-Test10" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "MS-Test10" -> null
      - node_id                     = "R_kgDOLCWx2g" -> null
      - private                     = false -> null
      - repo_id                     = 740667866 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:jrs-org/MS-Test10.git" -> null
      - svn_url                     = "https://github.com/jrs-org/MS-Test10" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.repos.github_repository.repository_branch_autoninit["MS-Test12"] will be destroyed
  # (because github_repository.repository_branch_autoninit is not in configuration)
  - resource "github_repository" "repository_branch_autoninit" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "master" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Repository managed by Terraform" -> null
      - etag                        = "W/\"09c05f3f28bdfb33c2cc4bf41b136f3b0d0444fda95ce10d09c547ece86e4a80\"" -> null
      - full_name                   = "jrs-org/MS-Test12" -> null
      - git_clone_url               = "git://github.com/jrs-org/MS-Test12.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/jrs-org/MS-Test12" -> null
      - http_clone_url              = "https://github.com/jrs-org/MS-Test12.git" -> null
      - id                          = "MS-Test12" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "MS-Test12" -> null
      - node_id                     = "R_kgDOLDTAzQ" -> null
      - private                     = false -> null
      - repo_id                     = 741654733 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:jrs-org/MS-Test12.git" -> null
      - svn_url                     = "https://github.com/jrs-org/MS-Test12" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.repos.github_repository.repository_branch_autoninit["terraform-jrs-local"] will be destroyed
  # (because github_repository.repository_branch_autoninit is not in configuration)
  - resource "github_repository" "repository_branch_autoninit" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Repository managed by Terraform" -> null
      - etag                        = "W/\"805d8360df37225f93ab55944fe802e04955b16c1fe93c120397e385dfd7cd1e\"" -> null
      - full_name                   = "jrs-org/terraform-jrs-local" -> null
      - git_clone_url               = "git://github.com/jrs-org/terraform-jrs-local.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/jrs-org/terraform-jrs-local" -> null
      - http_clone_url              = "https://github.com/jrs-org/terraform-jrs-local.git" -> null
      - id                          = "terraform-jrs-local" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "terraform-jrs-local" -> null
      - node_id                     = "R_kgDOLCe4eg" -> null
      - primary_language            = "HCL" -> null
      - private                     = false -> null
      - repo_id                     = 740800634 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:jrs-org/terraform-jrs-local.git" -> null
      - svn_url                     = "https://github.com/jrs-org/terraform-jrs-local" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.repos.github_repository_file.pipeline_file[4] will be created
  + resource "github_repository_file" "pipeline_file" {
      + branch              = "refs/heads/master"
      + commit_message      = "Añade o actualiza pipelines_file via terraform ***NO_CI***"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: 001-ms-template-caller
            
            on:
              push:
                branches: none # [ main ]
              pull_request:
                branches: none # [ main ]
            
              # Allows you to run this workflow manually from the Actions tab
              workflow_dispatch:
            
            jobs:
              call-pipeline-workflow-A:
                uses: josue-r/Pipelines/.github/workflows/github-pipelines.yml@main
                with:
                  username: Josue
                  lastname: Ruiz
                secrets:
                  token: ${{ secrets.TOKEN }}
            
              call-pipeline-workflow-B:
                uses: josue-r/Pipelines/.github/workflows/github-pipelines.yml@main
                with:
                  username: Vero
                  lastname: Zamora
                secrets:
                  token: ${{ secrets.TOKEN }}
        EOT
      + file                = ".github/workflows/github-pipelines.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "MS-Test13"
      + sha                 = (known after apply)
    }

  # module.repos.github_repository_file.pr_template[4] will be created
  + resource "github_repository_file" "pr_template" {
      + branch              = "refs/heads/master"
      + commit_message      = "Añade o actualiza pr_template via terraform ***NO_CI***"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## What does this PR do?
            
            [comment]: <> (A brief explanation synthesizing the feature, bug or, fix.)
            
            - this
            - that
            
            ## Where should the reviewer start?
            
            [comment]: <> (Explain where the reviewer should start to review the whole addition or subtractions.)
            :checkered_flag:
            
            ## How should this be manually tested?
            
            [comment]: <> (List of steps to reproduce, corroborate, or tests to run. Write this section enough so that external users can also follow it and test the fix.)
            
            1. :one:
            2. :two:
            3. :tada:
            
            ## Any background context you want to provide?
            
            [comment]: <> (Any information regarding the PR that the reviewer should know.)
            :construction:
            
            ## What are the relevant tickets?
            
            [comment]: <> (Link to issues, related PR, JIRA issues, etc.)
            Closes [JIRA/Monday/{TICKET_ID}]()
            
            ## Screenshots
            
            [comment]: <> (Screenshots of the feature if available.)
            :camera:
            
            ## Questions
            
            [comment]: <> (If available, to another developer or reviewer.)
            :question:
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "MS-Test13"
      + sha                 = (known after apply)
    }

Plan: 9 to add, 3 to change, 4 to destroy.

Changes to Outputs:
  + repo_full_name = {
      + MS-Tes11            = (known after apply)
      + MS-Test10           = (known after apply)
      + MS-Test12           = (known after apply)
      + MS-Test13           = (known after apply)
      + terraform-jrs-local = (known after apply)
    }

```

</details>


*Pusher: @josue-r, Action: `pull_request`, Working Directory: `/actions-runner/_work/terraform-jrs-local/terraform-jrs-local`, Workflow: `Create terraform plan`*